app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tool"], ["created_at", "2015-05-15 00:05:03.117791"], ["updated_at", "2015-05-15 00:05:03.117791"]]
---
  def create
    @band = Band.create(band_params)