app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "owq5P7QK1wwmAx2pnrX7Yg"], ["updated_at", "2015-05-14 22:53:56.052673"], ["id", 6]]
---
  def create
    @user = User.create(user_params)
    if @user.save